[
    {
        "id": 1,
        "mediaType": "video",
        "mediaPath": "/tti.mp4",
        "title": "Game Development: Total Trash Island",
        "description": "Developed a first-person shooter in Unity for the Ubisoft Australia Game Jam 2024 around the theme 'trash', where the player eradicates enemies invading the island. Responsible for all enemy AI systems in the game.",
        "highlights": [
            "Engineered enemy AI featuring 2D billboard sprites in a 3D environment — an unconventional approach that gave the game a distinct, wacky visual identity.",
            "Implemented pathfinding and animation behaviors using Unity's NavMesh and animation systems under tight game jam constraints."
        ],
        "toolsUsed": "Unity, C#",
        "projectType": "Game Development",
        "myRole": "Unity Programmer"
    },
    {
        "id": 2,
        "mediaType": "image",
        "mediaPath": "/portfolio9.jpg",
        "title": "Distrosub",
        "description": "Architected and deployed scalable AWS cloud infrastructure (EC2, S3, ECS, RDS, Elasticache) and CI/CD pipelines using GitHub Actions for a music streaming platform serving thousands of users.",
        "highlights": [
            "Built production-ready full-stack application using Node.js and Next.js with Progressive Web App (PWA) capabilities, successfully deployed to Apple App Store and Google Play Store.",
            "Led Agile sprint planning, conducted code reviews, and mentored a 5-person engineering team while reporting directly to the founder."
        ],
        "toolsUsed": "AWS, Node.js, Next.js, TypeScript, CI/CD, GitHub Actions, PWA, React",
        "projectType": "Full Stack Development",
        "myRole": "Software Engineer"
    },
    {
        "id": 3,
        "mediaType": "image",
        "mediaPath": "/portfolio8.jpg",
        "title": "Internship: TechFlouu",
        "description": "Developed and shipped production features for TechFlouu's platform using Next.js, TypeScript, React Native, and Node.js, improving user engagement and platform performance.",
        "highlights": [
            "Delivered end-to-end full-stack features with comprehensive technical documentation following best practices.",
            "Collaborated effectively in a fully remote, multi-national Agile environment across different time zones."
        ],
        "toolsUsed": "Next.js, TypeScript, React Native, Node.js, REST API, Git",
        "projectType": "Full Stack Development",
        "myRole": "Full Stack Developer Intern"
    },
    {
        "id": 4,
        "mediaType": "video",
        "mediaPath": "/omz.mp4",
        "title": "Game Development: Old Man Zeus",
        "description": "Developed a fast-paced VR action game in just 9 days for VR Jam 2. As the once-mighty Zeus, now retired, the player defends their home from hordes of minotaurs using legendary lightning powers — charging bolts via electrical outlets and summoning Olympian allies.",
        "highlights": [
            "Designed and implemented core VR gameplay loop including charge-up lightning mechanics, interactive electrical outlet interactions, and celestial alarm summoning system.",
            "Delivered a polished, fully playable VR experience as Lead Gameplay Programmer within a 9-day jam deadline using Unity XR Interaction Toolkit."
        ],
        "toolsUsed": "Unity, C#, Unity XRI Toolkit",
        "projectType": "Game Development",
        "myRole": "Lead Gameplay Programmer"
    },
    {
        "id": 5,
        "mediaType": "image",
        "mediaPath": "/portfolio7.jpg",
        "title": "Internship: Gradient Academy",
        "description": "Delivered full-stack features for Gradient's EdTech platform using Next.js, TypeScript, and Django REST Framework, directly contributing to 5x user growth (25,000 to 125,000) within 6 months.",
        "highlights": [
            "Architected and shipped three production features: real-time interactive exercise system, AI-powered chat application with streaming responses, and collaborative flashcard system with spaced repetition."
        ],
        "toolsUsed": "Next.js, TypeScript, Django, Python, REST API, PostgreSQL, Git",
        "projectType": "Full Stack Development",
        "myRole": "Software Engineer Intern"
    },
    {
        "id": 6,
        "mediaType": "image",
        "mediaPath": "/portfolio5.jpg",
        "title": "Internship: MoneyFitt SG",
        "description": "Developed and optimized mobile application features for MoneyFitt's FinTech platform using Angular, Ionic, and TypeScript, enhancing user experience and app performance.",
        "highlights": [
            "Built RESTful API integrations and optimized backend services using Spring Boot and Java for improved mobile responsiveness."
        ],
        "toolsUsed": "Angular, Ionic, TypeScript, Spring Boot, Java, REST API, Git",
        "projectType": "Mobile Development",
        "myRole": "Mobile Developer Intern"
    },
    {
        "id": 7,
        "mediaType": "video",
        "mediaPath": "/tps-ue.mp4",
        "title": "Game Development: UE5 Third Person Shooter Prototype",
        "description": "Designed and programmed a third-person shooter prototype in Unreal Engine 5 using Blueprint visual scripting, exploring animation systems, UI design, and AI enemy development as a learning-focused solo project.",
        "highlights": [
            "Implemented third-person shooter mechanics, animation state machines, and HUD UI entirely within Unreal Engine's Blueprint system.",
            "Built AI enemy behavior trees to populate the prototype world and deepen understanding of UE5's AI and animation pipelines."
        ],
        "toolsUsed": "Unreal Engine 5, Blueprint",
        "projectType": "Game Development",
        "myRole": "Unreal Programmer"
    },
    {
        "id": 8,
        "mediaType": "image",
        "mediaPath": "/portfolio6.jpg",
        "title": "Hackathon: UQUIZZLE",
        "description": "Won 1st place at UQCS Hackathon 2024 (35+ teams). Engineered a Chrome extension for lecture recordings using React.js, implementing responsive UI/UX design and state management.",
        "highlights": [
            "Led frontend architecture decisions and UI/UX design, delivering a polished product within 48-hour deadline."
        ],
        "toolsUsed": "React.js, JavaScript, Chrome Extensions API, HTML5, CSS3, Git",
        "projectType": "Frontend Development",
        "myRole": "Frontend Engineer & UI Designer"
    },
    {
        "id": 9,
        "mediaType": "image",
        "mediaPath": "/portfolio1.jpg",
        "title": "Hackathon: PEOPL.",
        "description": "Won 1st place in Youth Empowerment Track at Garuda Hacks 4.0. Built a community discussion web application using React.js and TypeScript with focus on accessibility and responsive design.",
        "highlights": [
            "Implemented component-driven architecture and reusable UI components following React best practices."
        ],
        "toolsUsed": "React.js, TypeScript, HTML5, CSS3, Responsive Design, Git",
        "projectType": "Frontend Development",
        "myRole": "Frontend Developer"
    },
    {
        "id": 10,
        "mediaType": "video",
        "mediaPath": "/tickets-please.mp4",
        "title": "Game Development: Tickets Please",
        "description": "Led gameplay programming for a team-built game, responsible for implementing all player interactions and enemy AI systems using Unity and C#.",
        "highlights": [
            "Engineered adaptive enemy AI that dynamically adjusts behavior based on player interactions, creating emergent and responsive gameplay scenarios.",
            "Owned the full gameplay programming scope as Lead Gameplay Programmer, delivering core mechanics and AI systems within team deadlines."
        ],
        "toolsUsed": "Unity, C#",
        "projectType": "Game Development",
        "myRole": "Lead Gameplay Programmer"
    },
    {
        "id": 11,
        "mediaType": "video",
        "mediaPath": "/vr-space.mp4",
        "title": "Game Development: VR Space Shooter",
        "description": "Developed immersive VR game application using Unity and C#, implementing physics-based interactions, AI behavior systems, and 3D spatial audio for enhanced user experience.",
        "highlights": [
            "Engineered custom enemy AI using state machines and Unity's NavMesh pathfinding system."
        ],
        "toolsUsed": "Unity, C#, Unity XR Toolkit, 3D Graphics, Game Development",
        "projectType": "Game Development",
        "myRole": "VR Developer"
    },
    {
        "id": 12,
        "mediaType": "image",
        "mediaPath": "/portfolio2.jpg",
        "title": "Web Development: OKK UI 2022",
        "description": "Developed responsive web application using React.js and Tailwind CSS, creating reusable component library and implementing mobile-first design principles.",
        "highlights": [
            "Created wireframes and prototypes in Figma, collaborating with stakeholders to align on project requirements."
        ],
        "toolsUsed": "React.js, Tailwind CSS, JavaScript, Responsive Design, Figma, Git",
        "projectType": "Frontend Development",
        "myRole": "Web Developer"
    },
    {
        "id": 13,
        "mediaType": "video",
        "mediaPath": "/opengl-mc.mp4",
        "title": "Computer Graphics: Minecraft World Generation",
        "description": "Built procedural terrain generation system using C++ and OpenGL, implementing Perlin noise algorithms, real-time lighting with shadow mapping, and optimized rendering pipeline.",
        "highlights": [
            "Developed PCF shadow mapping, dynamic day/night cycle, and view frustum culling for performance optimization."
        ],
        "toolsUsed": "C++, OpenGL, GLSL, GLFW, GLM, Graphics Programming",
        "projectType": "Computer Graphics",
        "myRole": "Graphics Programmer"
    },
    {
        "id": 14,
        "mediaType": "image",
        "mediaPath": "/portfolio3.jpg",
        "title": "Web Development: ACB-ISBE REVAMPED",
        "description": "Led full-stack development of web application using Django, Python, and JavaScript, implementing RESTful APIs and responsive frontend with Tailwind CSS.",
        "highlights": [
            "Collaborated in Agile team environment, delivering mobile-responsive design and AJAX-powered dynamic content."
        ],
        "toolsUsed": "Django, Python, JavaScript, Tailwind CSS, REST API, AJAX, PostgreSQL, Git",
        "projectType": "Full Stack Development",
        "myRole": "Full Stack Developer"
    },
    {
        "id": 15,
        "mediaType": "image",
        "mediaPath": "/portfolio4.jpg",
        "title": "UI/UX Design: STUDENTXCEO INTERNATIONAL SUMMIT 2022",
        "description": "Designed user interfaces and user experience flows for international summit website, creating wireframes, prototypes, and design system documentation.",
        "highlights": [
            "Conducted user research and usability testing, collaborating with development team to ensure design implementation accuracy."
        ],
        "toolsUsed": "Figma, Whimsical, UI/UX Design, Wireframing, Prototyping, User Research",
        "projectType": "UI/UX Design",
        "myRole": "UI/UX Designer"
    }
]
