[
    {
        "id": 1,
        "mediaType": "image",
        "mediaPath": "/portfolio7.jpg",
        "title": "Internship: Gradient Academy",
        "description": "Part of full-stack development for Gradient's web platform using NextJS/TypeScript and Django, contributing to user growth from 25,000 to 125,000 in 6 months.",
        "highlights": [
            "Architected and delivered three key features: an interactive exercise system with real-time assessment, an AI chat application with streaming functionality, and an AI-powered collaborative flashcard system."
        ],
        "toolsUsed": "NextJS, TypeScript, Django, Python, Git",
        "projectType": "Software Development",
        "myRole": "Software Engineer Intern"
    },
    {
        "id": 2,
        "mediaType": "image",
        "mediaPath": "/portfolio5.jpg",
        "title": "Internship: MoneyFitt SG",
        "description": "My first internship experience, I built new features for MoneyFitt's mobile app using Ionic and Angular to improve user experience, and optimized the app's backend with Spring Boot for better mobile service support.",
        "toolsUsed": "Angular, Ionic, Spring Boot, Java, Typescript, HTML, CSS, Git",
        "projectType": "Mobile Development",
        "myRole": "Mobile Developer"
    },
    {
        "id": 3,
        "mediaType": "image",
        "mediaPath": "/portfolio6.jpg",
        "title": "Hackathon: UQUIZZLE",
        "description": "Secured 1st place at UQCS Hackathon 2024, competing against 35 other teams. Developed an extension for UQ lecture recordings as the Frontend Engineer and UI Designer, utilizing ReactJS and Craco to enhance the learning experience.",
        "toolsUsed": "ReactJS, Craco, JavaScript, HTML, CSS, Git",
        "projectType": "Frontend Development",
        "myRole": "Frontend Engineer & UI Designer"
    },
    {
        "id": 4,
        "mediaType": "image",
        "mediaPath": "/portfolio1.jpg",
        "title": "Hackathon: PEOPL.",
        "description": "My team won 1st place in the Youth Empowerment Track at Garuda Hacks 4.0 by creating an innovative youth-centered community discussion app. Focusing on delivering a seamless and visually appealing user experience.",
        "toolsUsed": "Typescript, ReactJS, HTML, CSS, Git",
        "projectType": "Web Development",
        "myRole": "Frontend Developer"
    },
    {
        "id": 5,
        "mediaType": "video",
        "mediaPath": "/vr-space.mp4",
        "title": "Game Development: VR Space Shooter",
        "description": "Developed a VR shooter game as a personal project to explore the capabilities of Unity's XR toolkit. Implemented realistic weapon mechanics, enemy AI, and immersive level design. This project honed my skills in C# scripting, VR interaction, and spatial audio.",
        "toolsUsed": "Unity, C#, Unity XRI Toolkit",
        "projectType": "Game Development",
        "myRole": "VR Developer"
    },
    {
        "id": 6,
        "mediaType": "video",
        "mediaPath": "/opengl-mc.mp4",
        "title": "Computer Graphics: Minecraft World Generation",
        "description": "Developed a simplified Minecraft-inspired terrain generator using procedural generation techniques. Implemented 2D Perlin noise for natural-looking terrain generation, featuring a dynamic day/night cycle with realistic lighting and shadows. Created an optimized rendering system with view distance management and fog effects. The project includes textured blocks, smooth camera controls, and PCF shadow mapping for realistic shadow rendering.",
        "toolsUsed": "C++, OpenGL, GLFW, GLM",
        "projectType": "Computer Graphics Development",
        "myRole": "Graphics Programmer"
    },
    {
        "id": 7,
        "mediaType": "image",
        "mediaPath": "/portfolio2.jpg",
        "title": "Web Development: OKK UI 2022",
        "description": "As a Web Developer at OKK UI, I developed an intuitive UI using Tailwind CSS and ReactJS, enhancing the website's aesthetic appeal and user experience. I also created wireframes to facilitate collaboration and align with project goals.",
        "toolsUsed": "Tailwind CSS, ReactJS, Git",
        "projectType": "Web Development",
        "myRole": "Web Developer"
    },
    {
        "id": 8,
        "mediaType": "image",
        "mediaPath": "/portfolio3.jpg",
        "title": "Web Development: ACB-ISBE REVAMPED",
        "description": "As part of my college project, I worked with a team to revamp the website and create a mobile app for the ACB-ISBE website. We used Tailwind, JavaScript, Django, and Python to create a visually appealing, responsive, and user-friendly website.",
        "toolsUsed": "Tailwind CSS, JavaScript, AJAX, Django, Python, Git",
        "projectType": "Full Stack Development",
        "myRole": "Full Stack Developer"
    },
    {
        "id": 9,
        "mediaType": "image",
        "mediaPath": "/portfolio4.jpg",
        "title": "UI/UX Design: STUDENTXCEO INTERNATIONAL SUMMIT 2022",
        "description": "I contributed to the design of the StudentXCEO International Summit 2022 website. I made the designs look better and easier to use by creating wireframes and prototypes. I worked with the developers to make sure the designs were implemented correctly. My work helped make the website and app more user-friendly for everyone.",
        "toolsUsed": "Figma, Whimsical",
        "projectType": "UI/UX Design",
        "myRole": "UI/UX Designer"
    }
]
